In [1]:
import pandas as pd

In [2]:
import numpy as np

In [31]:
arr = np.array([[1, 2, 3], [4, 5, 6]])
df = pd.DataFrame(arr,columns=['col 1','col 2','col 3'])

In [32]:
df

   col 1  col 2  col 3
0      1      2      3
1      4      5      6

In [17]:
df.columns

Index(['col 1', 'col 2', 'col 3'], dtype='object')

In [33]:
df['col 2']

0    2
1    5
Name: col 2, dtype: int32

In [34]:
s1 = pd.Series(np.random.randn(5),index=['A','B','C','D','E'])

In [35]:
s1

A    0.875752
B    2.026990
C    1.123949
D    1.284479
E   -0.403518
dtype: float64

In [36]:
s2 = pd.Series(np.random.randn(5),index=['A','B','C','D','E'])

In [37]:
s2

A    0.865170
B   -0.562238
C    0.468411
D    0.821307
E   -0.276860
dtype: float64

In [17]:
df = pd.concat([s1, s2],axis=1).reset_index()

In [18]:
s2.to_frame()

          0
A -1.616942
B -0.707990
C  1.653171
D -1.343818
E -0.405725

In [19]:
my_df = pd.DataFrame(np.random.randn(25).reshape((5,5)),index=['a','b','c','d','e'],columns=['c1','c2','c3','c4','c5'])

In [20]:
my_df

         c1        c2        c3        c4        c5
a  0.787884 -0.357098  1.955615  2.122599 -0.162387
b -0.367842  0.785828  2.455648  0.821933 -1.534851
c  0.187187  0.178690 -1.478245 -2.527995 -0.484215
d  1.163978  0.866781  0.682033 -0.818453 -0.363958
e  0.228739  1.016502  0.079450  0.265334 -1.581657

In [22]:
my_df.drop('c2',axis=1,inplace=True)

In [121]:
my_df

        col1      col2      col3      col4
r1  1.100057  0.226894 -0.212394  0.121284
r2 -0.815368  0.695376  0.556949 -1.135506
r3  2.365687  0.703111 -0.270769 -0.313596
r4 -0.247526  2.058571 -0.168283 -0.124014
r5  0.688753 -0.185109 -0.745150 -1.345342

In [23]:
my_df.columns = ['col1', 'col2', 'col3', 'col4']

In [30]:
my_df.loc['a']['col1']

0.7878841776296868

In [127]:
my_df.iloc[0][1]

0.22689392096827091

In [128]:
my_df.iloc[0,1]

0.22689392096827091

In [134]:
my_df

        col1      col2      col3      col4
r1  1.100057  0.226894 -0.212394  0.121284
r2 -0.815368  0.695376  0.556949 -1.135506
r3  2.365687  0.703111 -0.270769 -0.313596
r4 -0.247526  2.058571 -0.168283 -0.124014
r5  0.688753 -0.185109 -0.745150 -1.345342

In [158]:
my_df

        col1      col2      col3      col4
r1  1.100057  0.226894 -0.212394  0.121284
r2 -0.815368  0.695376  0.556949 -1.135506
r3  2.365687  0.703111 -0.270769 -0.313596
r4 -0.247526  2.058571 -0.168283 -0.124014
r5  0.688753 -0.185109 -0.745150 -1.345342

In [184]:
my_df.sort_values(by=['col1','col4'])

        col1      col2      col3      col4
r2 -0.815368  0.695376  0.556949 -1.135506
r4 -0.247526  2.058571 -0.168283 -0.124014
r5  0.688753 -0.185109 -0.745150 -1.345342
r1  1.100057  0.226894 -0.212394  0.121284
r3  2.365687  0.703111 -0.270769 -0.313596

In [185]:
data = {'first_name': ['Noureddin', 'Josef', 'Mike', 'Ali', 'Luke'],
        'last_name': ['Sadawi', 'Baker', 'Brooks', 'Shah', 'Brown'],
        'year': [2015, 2009, 2013, 2016, 2014],
        'score': [422, 322, 233, 223, 401]
        }
df = pd.DataFrame(data, index = ['Tripoli', 'Birmingham', 'London', 'Islamabad', 'New York'])
df

           first_name last_name  score  year
Tripoli     Noureddin    Sadawi    422  2015
Birmingham      Josef     Baker    322  2009
London           Mike    Brooks    233  2013
Islamabad         Ali      Shah    223  2016
New York         Luke     Brown    401  2014

In [187]:
df.sort_values(by='last_name', ascending=True)

           first_name last_name  score  year
Birmingham      Josef     Baker    322  2009
London           Mike    Brooks    233  2013
New York         Luke     Brown    401  2014
Tripoli     Noureddin    Sadawi    422  2015
Islamabad         Ali      Shah    223  2016

In [188]:
df.sort_values(by=['last_name','score'])

           first_name last_name  score  year
Birmingham      Josef     Baker    322  2009
London           Mike    Brooks    233  2013
New York         Luke     Brown    401  2014
Tripoli     Noureddin    Sadawi    422  2015
Islamabad         Ali      Shah    223  2016

In [196]:
m = df[df < 240]

In [197]:
m

           first_name last_name  score  year
Tripoli     Noureddin    Sadawi    NaN   NaN
Birmingham      Josef     Baker    NaN   NaN
London           Mike    Brooks  233.0   NaN
Islamabad         Ali      Shah  223.0   NaN
New York         Luke     Brown    NaN   NaN

In [202]:
m.dropna(how='all',axis=1,thresh=3)

           first_name last_name
Tripoli     Noureddin    Sadawi
Birmingham      Josef     Baker
London           Mike    Brooks
Islamabad         Ali      Shah
New York         Luke     Brown

In [203]:
m

           first_name last_name  score  year
Tripoli     Noureddin    Sadawi    NaN   NaN
Birmingham      Josef     Baker    NaN   NaN
London           Mike    Brooks  233.0   NaN
Islamabad         Ali      Shah  223.0   NaN
New York         Luke     Brown    NaN   NaN

In [206]:
m.fillna(1,inplace=True)

In [207]:
m

           first_name last_name  score  year
Tripoli     Noureddin    Sadawi    1.0   1.0
Birmingham      Josef     Baker    1.0   1.0
London           Mike    Brooks  233.0   1.0
Islamabad         Ali      Shah  223.0   1.0
New York         Luke     Brown    1.0   1.0